Revit 2024 API
DocumentEntryPoint.SaveAs Method
Overload List
Name | Description
SaveAs(String)
 Saves the document to a given file path.
 (Inherited from Document.)
SaveAs(String, SaveAsOptions)
 Saves the document to a given file path.
 (Inherited from Document.)
SaveAs(ModelPath, SaveAsOptions)
 Saves the document to a given path.
 (Inherited from Document.)
See Also
DocumentEntryPoint Class
DocumentEntryPoint Members
Autodesk.Revit.DB.Macros Namespace